"use strict";

// const getRandomInt = (max) => {
//   return Math.floor(Math.random() * max);
// };

// const isNum = (n) => {
//   return !isNaN(parseFloat(n)) && isFinite(n);
// };

// var start = () => {
//   var randomNumber = getRandomInt(100);
//   console.log("randomNumber: ", randomNumber);
//   var game = () => {
//     var num = prompt(
//       "Угадай число от 1 до 100(Для выхода оставьте строку пустой)"
//     );
//     if (num === null) {
//       alert("GoodBye");
//       return;
//     }
//     if (isNum(num)) {
//       var realNumber = +num;
//       if (realNumber > randomNumber) {
//         alert("Загаданное число меньше");
//         game();
//       } else if (realNumber < randomNumber) {
//         alert("Загаданное число больше");
//         game();
//       } else {
//         if (confirm("Вы угадали! Сыграем ещё?")) {
//           start();
//         } else {
//           alert("goodbye");
//           return;
//         }
//       }
//     } else {
//       alert("Введите число");
//       game();
//     }
//   };
//   game();
// };
// start();

// Используйте функции alert, confirm, prompt для общения с пользователем.
// Написать игровой бот.
// "Загадывание случайного числа от 1 до 100"
// Что должна делать программа:
// — спрашивает пользователя: "Угадай число от 1 до 100".
// — если пользовательское число больше, то бот выводит "Загаданное число меньше" и предлагает ввести новый вариант;
// — если пользовательское число меньше, то бот выводит "Загаданное число больше" и предлагает ввести новый вариант;
// — если пользователь ввел не число, то выводит сообщение "Введи число!" и предлагает ввести новый вариант;
// — если пользователь нажимает "Отмена", то игра заканчивается и выводится сообщение "Игра окончена".
// —  если пользовательское число равно загаданному, то игра заканчивается и выводит сообщение  /
//    "Поздравляю, Вы угадали!!!"
// Программа должны быть выполнена с помощью рекурсии, без единого цикла.
// Загаданное число должно храниться «в замыкании»

// Дописать функционал игрового бота.
// Кол-во попыток пользователя должно быть ограничено: 10
// — если пользовательское число больше, то бот выводит "Загаданное число меньше, осталось попыток
//" и предлагает ввести новый вариант;
// — если пользовательское число меньше, то бот выводит "Загаданное число больше, осталось попыток
////" и предлагает ввести новый вариант;
// — если пользователь вводит правильное число, то бот выводит "Поздравляю, Вы угадали!!! Хотели бы
// сыграть еще?", при нажатии ОК игра перезапускается (снова 10 попыток и новое загаданное число)
// — если пользователь ввел не число, то выводит сообщение "Введи число!" и предлагает ввести новый ////вариант;
// — если пользователь нажимает "Отмена", то игра выводит прощальное сообщение и завершается.
// — если закончились попытки то программа сообщает: "Попытки закончились, хотите сыграть еще?"

var getRandomNumber = (max) => {
  return Math.floor(Math.random() * max);
};

var numberToTry = (item) => {
  return item;
};

const isNum = (num) => {
  return !isNaN(parseFloat(num)) && isFinite(num);
};

var start = () => {
  var randomNumber = getRandomNumber(100);
  var numberToTryLeave = numberToTry(10);

  var game = () => {
    var num = prompt(
      "Угадай число от 1 до 100, У вас залишилося " +
        numberToTryLeave +
        " спроб"
    );
    if (num === null) {
      alert("goodbye!!!");
      return;
    } else if (numberToTryLeave === 1) {
      if (confirm("Попытки закончились, хотите сыграть еще?")) {
        start();
      } else {
        alert("goodbye!!!");
      }
      return;
    }
    if (isNum(num)) {
      var realNumber = +num;
      if (realNumber > randomNumber) {
        alert("Загаданное число меньше");
        numberToTryLeave--;
        game();
      } else if (realNumber < randomNumber) {
        alert("Загаданное число больше");
        numberToTryLeave--;
        game();
      } else {
        if (confirm("You win.Do you want to play again?")) {
          start();
        } else {
          alert("goodbye!!!");
          return;
        }
      }
    } else {
      alert("please enter a number");
      game();
    }
  };
  game();
};
start();
